app/Http/Controllers/Admin/ViewController.php

    public function login(Request $request,Admin $admin){
        if($request->isMethod('post')){//接收并判断数据的请求类型
            $data=$request->all();//接收所有数据
            //dd($data);
            $res=[//验证信息规则
                "name"=>"required",
                "pwd"=>"required",
                "cod"=>"required|captcha",
            ];
            $mo=[//返回验证信息
                "name.required"=>"用户名不存在",
                "pwd.required"=>"密码错误",
                "cod.required"=>"验证码不能为空",
                "cod.captcha"=>"验证码错误",
            ];
            $cnd=Validator::make($data,$res,$mo);//验证信息
            if($cnd->fails()){//判断是否验证失败
                $request->flash();//返回一次性session
                return redirect()->back()->withErrors($cnd,"Error");//返回错误信息
            }
            $str=$admin->where("name",$data["name"])->first();
            /*dump(Hash::check($data['pwd'],$str->pwd));
            die;*/
            if(!$str){
                $request->flash();//返回一次性session
                return redirect()->back()->withErrors($cnd,"Error");//返回错误信息
            }
            $cct=DB::table('juese')->where('id',$str->qx)->first();
---
select * from `ra_juese` where `id` = '1' limit 1